[
"harry - Harry Angel, played by Mickey Rourke, is the protagonist in 1987s “Angel Heart”, which also stars Robert De Niro. There is a scene where De Niro's character spills salt on a restaurant table and Angel takes a pinch and throws it over his left shoulder. One theory for this superstition dates back to Leonardo da Vinci's painting The Last Supper. In the painting, Judas is depicted to having knocked over salt. The Bible says Judas betrayed Jesus and so people associated knocking over salt with inviting the Devil to tempt you to do evil deeds. Throwing the salt over your left shoulder (where the Devil lurks) would blind the Devil (or evil Angel) and stop them. The Devil must be so salty.",
"buffy - “Buffy the Vampire Slayer” (1992) is a light horror comedy written and created by Joss Whedon. Whedon was ultimately unhappy with the film due to having to modify the story to be lighter. In 1997 he created the “Buffy the Vampire Slayer” TV series in which he used his original script as a basis for.",
"lynch - David Lynch is an American filmmaker, painter, visual artist, actor, musician, writer, and philanthropist. He rose to fame after his first feature length film “Eraserhead” (1977). Ever the artist, personally approved DVD releases of his movies do not have any chapter stops. This is done because he believes that films are meant to be viewed from beginning to end.",
"horde - A horde of zombies can scale a tall wall in 2013s “World War Z”; a talent kept in the video game of the same name, released in 2019. The movie was based on Max Brooks' novel “World War Z: An Oral History of the Zombie War”. Brooks has commented that he knew that the movie adaptation was going to be different from his novel and was prepared to hate it because of the differences. After watching it he found that he actually liked it because it was different from his novel. He felt that since he didn't have creative ownership of the characters, he didn't have anything to be mad about. He probably also was not mad at the horde of money he got.",
"chant - Creepy and ominous chants are staples to folk horror. An eerie culty chant can be heard early on in “Rosemary's Baby” (1968). At one point in the film Rosemary, played by Mia Farrow, is reading “Yes I Can”, Sammy Davis Jr's autobiography. Some people say this was included due to Farrow being married to Frank Sinatra at the time; Sinatra and Davis were members of the Rat Pack. However, others say it was an intentional symbolism; Davis Jr. was a member of the Church of Satan during the time the film came out. The church's appeal to him was its focus on unbridled naturism and hedonism; in particuar, the pleasures of the flesh. He eventually left it when a church orgy got out of hand. Rumor has it that he chanted “Yes I Can!” as he ran away.",
"acidy - Vincent Price meets an acidy death in 1959s “House on Haunted Hill”. The film is known for it's gimmicky beginning in which spooky sound effects were played throughout the theater as a scare tactic. The effect was so successful that it started the idea of novelty “haunting records” of which are commonly used during Halloween parties and haunted house attractions.",
"graft - “Eyes Without a Face” (1960) is a French-language horror film in which a doctor is obsessed with successfully grafting a new face on his disfigured daughter. Upon it's original release, the film was met with generally negative reception. It was thought to be so bad that a critic was almost fired for having wrote a positive review on the film. The film was re-released in September 1986 to significantly more positive reception and has been an influence to many filmmakers. Michael Myers' mask from “Halloween” (1978) was said to be inspired by the mask the daughter wears throughout the film. The face peeling surgery in John Woo's “Face/Off”, as well as his penchant for the use of white doves in his films, is said to have been directly influenced by “Eyes Without a Face”.",
"angry - You've heard of angry ghosts in horror movies, but what about an angry house, such as in Shirley Jackson's novel “The Haunting of Hill House” (1959). Jackson's novel depicts a house as the supernatural entity that haunts its lodgers. It will go on to have several adaptations including two movies under the title of “The Haunting” released in 1963 and 1999. The director of the 1963 version of the movie, Robert Wise, got the idea to adapt it after reading a review of Jackson's novel. Wise asked Jackson if there were any other titles she considered for her novel because the actual title wasn't suited for a movie. She told him that the only other title she truly considered was “The Haunting”. Pretty wise of Robert, eh?",
"trick - “Trick 'r Treat” is a 2007 comedy horror movie consisting of five interwoven stories occurring on Halloween. In the story titled “Halloween School Bus Massacre”, the disabled kids in the segment were played by kids who were actually disabled. Their costumes were inspired by photos of neurodiverse kids in their homemade costumes. Talk about a treat!",
"opera - Lon Chaney plays the titular character in 1925s horror film “The Phantom of the Opera”. It being a silent film, Chaney had to act a lot with his hands. He happened to be well suited for this because both his parents were deaf and so he learned to be very expressive with his hands. That's hands on experience if I ever heard of one!",
"music - Horror music can make or break film. It sets the tone for the scenes and plays a large role in jump scares. Perhaps the most famous and recognizable horror music is that of the shower scene in Alfred Hitchcock's “Psycho” (1960). You'll be surprised to hear that Hitchcock originally wanted no music during the shower scene. However, the film's music composer, Bernard Herrmann, insisted there be music, and the rest is herstory.",
"dying - Dying is the end for some, but only the beginning for vampires Lestat and Louis in 1994s “Interview with the Vampire: The Vampire Chronicles”. The vampires in the film have pale and translucent-looking skin, giving them an eerie undead appearance. To achieve this effect the actors playing vampires were hung upside down for up to thirty minutes at a time so that the make-up artists could trace over the swollen veins caused by the rush of blood to their heads. At this point, wouldn't it be easier to go “method”?",
"moose - “Moose Jaws” was to be the title of the third installment of Kevin Smith's “True North” trilogy. The first and second being “Tusk” (2014) and “Yoga Hosers” (2016) respectively. The idea of “Tusk” came from an episode of Smith's podcast in which they discuss a viral internet ad in which an old man claimed to be offering free room and board in his house in exchange for a small favor — that the tenant dress up as a walrus for just two hours each day. Following the episode, Smith asked his audience to tweet #Walrusyes if they wanted him to turn the idea into a feature length film, or #Walrusno if they thought the idea was too ridiculous. After one day there were hundreds of #Walrusyes and a singular #Walrusno which had a caption of “I just tweeted ‘no’ to support the democratic process. 'Merica!”",
"tribe - In Eli Roth's “The Green Inferno” (2013), a group of activist students encounter a cannabalistic tribe in the Amazon rain forest. Roth approached villagers to be extras in the film. To get them to understand the idea of acting and movies, Roth brought a TV and showed them “Cannibal Holocaust” (1980), the inspiration for “The Green Inferno”. After filming wrapped, the villagers offered a two-year-old as a “thank you” for including them in the film. That's extreme method payment!",
"himbo - Used to describe an attractive, but vacuous man. It is a blend of “him” and “bimbo”. Believe it or not the term “bimbo” used to describe a brutish and unintelligent man as early as 1919. It comes from the Italian word “bimbo”, a masculine-gender term that means “baby” or “young child” (the feminine form being bimba). In 1920, the word began to be associated with woman as well. The term died out after the 1940s and resurfaced during the 1980s and '90s when political sex scandals started emerging. As “bimbo” started being used exclusively for females, exclusively male variations began to surface, most notably “himbo”. One example of a himbo in horror is the character Dewey from the “Scream” franchise, played by David Arquette.",
"pizza - Samantha Craft, played by Hayley Griffith, is the pizza-delivering heroine in “Satanic Panic” (2019). The title comes from the moral panic of alleged Satanic ritual abuse in the US in the 1980s. Panic was so widespread that at one point or another everything was connected to Satan; from Oprah to McDonald's to even ThunderCats! thunder, Thunder, THUNDER, THUNDERCATS RITUAOOOOOOOOOOOO!",
"culty - Many of horror's greatest movies were cult classics. One such cult classic is 1973s “The Wicker Man” (a movie that happens to be about a cult) starring horror titan Sir Christopher Lee. Lee considered this to be one of his greatest roles. He loved the movie so much that he paid for his own press tour out of pocket to hit everywhere that was willing to interview him about the movie. This hits harder considering that most of the cast, including Lee, worked without pay due to the movie's low budget.",
"blood",
"arose",
"wicca",
"bleat",
"beans",
"camps",
"hooks",
"evoke",
"hills",
"chill",
"canoe",
"dance",
"blunt",
"arrow",
"chest",
"awoke",
"ashes",
"manor",
"hairy",
"dread",
"fires",
"hives",
"crabs",
"covet",
"louis",
"runes",
"wards",
"nerds",
"quote",
"harpy",
"busan",
"sting",
"horns",
"grief",
"coals",
"meats",
"rigor",
"harga",
"afoul",
"actor",
"mimes",
"adult",
"ditch",
"toxic",
"altar",
"flame",
"pokes",
"moral",
"razor",
"rainy",
"dress",
"diced",
"human",
"lives",
"chefs",
"genie",
"vomit",
"herbs",
"chews",
"noise",
"mummy",
"gulps",
"shine",
"decay",
"gnarl",
"muddy",
"pukes",
"pious",
"hatch",
"nasty",
"tombs",
"fetid",
"chomp",
"cleft",
"artsy",
"booby",
"hippo",
"upset",
"burst",
"donna",
"drunk",
"shops",
"cloud",
"dazed",
"harms",
"wound",
"curse",
"rocky",
"gored",
"hydra",
"beast",
"chows",
"fungi",
"visit",
"crazy",
"shred",
"shout",
"enemy",
"dusky",
"nails",
"oscar",
"elder",
"necks",
"hausu",
"night",
"hitch",
"evils",
"horny",
"vigil",
"totem",
"awake",
"seven",
"tears",
"arise",
"being",
"husks",
"bobby",
"liver",
"aroma",
"scary",
"hacks",
"armed",
"chola",
"tooth",
"stalk",
"siren",
"boney",
"hades",
"steam",
"coils",
"hover",
"spell",
"henry",
"clock",
"beach - The setting for the horror movie ,'Old' (2021), by M. Night Shyamalan. Haunted beach",
"scaly",
"hocus",
"cloak",
"morph",
"troll",
"chaos",
"woman",
"vicar",
"cholo",
"lakes",
"guest",
"dares",
"claws",
"water",
"hells",
"fangs",
"axing",
"swamp",
"feral",
"risen",
"jujus",
"caged",
"hexer",
"bears",
"baddy",
"amiss",
"raimi",
"regan",
"spook",
"blade",
"photo",
"pikes",
"bundy",
"allan",
"plane",
"husky",
"lambs",
"hangs",
"hopes",
"wells",
"eagle",
"alone",
"lycan",
"copes",
"black",
"raspy",
"apart",
"cynic",
"gnome",
"howls",
"slain",
"giant",
"rabid",
"devil",
"miner",
"prank",
"alley",
"drill",
"damns",
"widow",
"among",
"froze",
"cuffs",
"cowed",
"croak",
"mushy",
"choir",
"comes",
"offer",
"freak",
"write",
"monks",
"witch",
"omega",
"crept",
"mandy",
"slime",
"grunt",
"norma",
"moans",
"dolls",
"clone",
"treat",
"crier",
"ashed",
"expel",
"slice",
"naked",
"veils",
"bakes",
"traps",
"lover",
"derry",
"syrup",
"agist",
"chuck",
"hicks",
"slimy",
"hides",
"ichor",
"codex",
"hoove",
"david",
"lurch",
"shank",
"demon",
"glove",
"gourd",
"signs",
"jotun",
"panic",
"story",
"feast",
"float",
"elegy",
"fears",
"annie",
"eddie",
"golem",
"baked",
"choky",
"diary",
"grave",
"codes",
"torch",
"moses",
"plant",
"dared",
"fairy",
"veiny",
"drugs",
"organ",
"biter",
"fable - ",
"count",
"train",
"megan",
"crime",
"bleak",
"sever",
"patty",
"booed",
"snake",
"nurse",
"sawed",
"puked",
"jenny",
"loser",
"calfs",
"crave",
"shark",
"atone",
"hunts",
"acids",
"louie",
"lodge",
"clubs",
"felon",
"gruel",
"gumbo",
"chops",
"wails",
"fight",
"alarm",
"goner",
"mince",
"campy",
"stabs",
"wolfs",
"poker",
"brood",
"brace",
"beaky",
"mists",
"puker",
"rhino",
"oozed",
"nymph",
"sword",
"alien",
"swarm",
"drags",
"dirty",
"catch",
"dooms",
"sleep",
"mural",
"wilde",
"nanny",
"edgar",
"child",
"cried",
"hosts",
"maims",
"hotel",
"beady",
"crush",
"peele",
"cabin",
"goths",
"flood",
"crude",
"randy",
"myths",
"ahabs",
"boris",
"antsy",
"virus",
"wield",
"cysts",
"growl",
"texas",
"dummy",
"fever",
"satan",
"gator",
"snaps",
"larva",
"alice",
"wendy",
"mouth",
"crash",
"attic",
"bully",
"coven",
"twist",
"wreck",
"biker",
"chads",
"poked",
"kitty",
"agism",
"charm",
"frogs",
"roman",
"cooks",
"nancy",
"peril",
"quiet",
"eater",
"entry",
"gooey",
"feeds",
"quoth",
"fried",
"salem",
"haunt",
"books",
"clown",
"panda",
"blaze",
"carny",
"magus",
"enter",
"tense",
"kabob",
"climb",
"amity",
"churn",
"taboo",
"tarot",
"maria",
"mazes",
"tempt",
"hexes",
"under",
"shore",
"plead",
"latex",
"clues",
"nicky",
"boobs",
"sally",
"class",
"shaun",
"chunk",
"faust"
]