[
"knife - In 'The Texas Chainsaw Massacre' (1974), Gunnar Hansen, the actor who plays Leatherface, actually slices Marilyn Burns' finger with a knife in the dinner scene. This was out of frustration as the blood tube kept clogging during several takes.",
"cults - Real life cults often inspire horror films; such as 2015s 'The Invitation'. The movie takes inspiration from the cult, Peoples Temple, led by Jim Jones.",
"jason - Happy Friday the 13th!",
"chase - 'The Shining' (1980) was one of the first movies to use Steadicam. Most notably used in the hedge maze chase scene at the film's climatic end.",
"bones - Speaking of bones - Linda Blair fractured her lower spine while filming 'The Exorcist' (1973). She was injured by the mechanical rig attached to the bed she was thrown around in. We watch this in the movie because everybody thought it was just great acting!",
"licks - Freddie Kruger's tongue almost licks Nancy during the famous 'Tongue Telephone' scene in 'A Nightmare on Elm Street' (1984). The actress who played Nancy reportedly asked to take the tongue prop home after shooting.",
"dream - The premise of the film 'It Follows' (2014) is based on the director's recurring dream in which he was being followed. Keir Gilchrist, who starred in the film, has said that the director wanted the film to feel like a bad dream that never ends.",
"craft - As in 'The Craft' (1996). Director Andrew Fleming followed the guidelines for a PG-13 rating, but a bunch of old crotchety men decided to give it an R rating because it contained teenage girls using witchcraft. Rude!",
"motel - There was once a real life Bate's Motel people could stay in along the CA-99 near Washington state. A huge horror nerd renamed his motel to Bate's Motel and would regularly put on costume parties. Unfortunately the motel was torn down in April of 2012. The hotel sign however remains intact.",
"hexed - In 1990s 'The Witches', the lead protagonist is hexed by the Grand High Witch, turning into a mouse. The scene occurs in a ballroom full of witches, many of whom were actually men in dresses. Who knew!?",
"scare - Love it or hate it, the 'Jump Scare' is a common trope in horror movies. Film historians say the first use of it is in 'Cat People' (1942) during the bus stop scene in which Alice is being stalked by Irena. Me-ow!",
"chord - The 'Jump Scare' is often accompanied by the 'Scare Chord'- a sudden and sharp sforzando of dissonance or sheer noise intended to jolt the audience. One notable use was at the end of 1980s 'Friday the 13th' when Jason's rotting corpse suddenly jumps out of the water and grabs final girl Alice. Yikes!",
"candy - Not including the 2021 'requel', 1992s 'Candyman' is the only horror movie to feature a black serial killer as it's villain.",
"cobra - 'Cult of the Cobra' (1955) was often shown after 'Revenge of the Creature' (1955) as a double creature feature in theaters. Looks like Mr. Gillman was in good cobra-ny!",
"groan - Zombies moan and groan. To portray realistic cannabalistic zombies in 'Night of the Living Dead' (1968), the filmakers had the zombie actors eating ham covered in chocolate syrup. Bone apple tee?",
"death - Death is inevitable both in life and horror movies. To this day, Vincent Price has the most on screen deaths out of any actor in a horror movie. He always paid the ultimate Price!",
"price - Happy Birthday to The Master of Horror, Vincent Price!",
"crate - From cursed objects to a live(undead?) vampire, crates often contain important plot devices in horror movies. In 1948s 'Abbott and Costello Meet Frankenstein', the comedic duo are in charge of a crate that contains Count Dracula, played by the late Bela Lugosi. Though Lugosi's portrayal of Dracula is arguably the most iconic, this movie marks the second and last time he plays Dracula.",
"jesse - Mark Patton plays protagonist Jesse Walsh in 'A Nightmare on Elm Street 2: Freddy's Revenge' (1985). This is the only film in the franchise in which the final girl is played by a male. Patton is considered the first male 'Scream Queen' for his portrayal of Jesse. Not that gender matters anymore!",
"ghost - One of the ghost occupants in '13 Ghosts' (1960) is a lion. This lion would go on to portray the Addams' house pet, Kitty Kat, in 'The Addams Family' (1964) TV show. I guess they got a lion's share of the spotlight!",
"bleed - Wesley Snipes plays the titular character in 1998s 'Blade'. In the movie, Deacon Frost bleeds Blade to complete a ritual that would turn himself into a vampire god. Apparently Jet Li was offered the role of Deacon Frost, but turned it down to do 'Lethal Weapon 4' (1998). I guess he didn't think the role in 'Blade' was 'the one'.",
"cliff - One of the most memorable scenes in Midsommar (2019) was the Ättestupa; the scene depicts two elders of Harga leaping off a cliff in ritual suicide, marking the end of their lifecycle. Ättestupa is a name given to several cliffs in Sweden, Norway and Iceland. According to folklore, these were sites of ritual senicide.",
"dimly - Dimly lit spaces are a staple to horror movies. Filmmakers utilize low key lighting to achieve this. Though in modern times this lighting technique is used in horror, thillers and dramas, low key lighting was a defining element of the 'noir' films of the '40s and '50s. It was used to achieve high contrasts between light and dark; in art it is called the 'chiaroscuro effect'. Bet you didn't know this was 'low key' an art lesson!",
"rabbi - In Jewish folklore, a rabbi, Judah Loew ben Bezalel, creates a golem to protect the Jewish people from antisemites; this story is depicted in the silent horror film 'The Golem' (1915). Some believe Mary Shelley borrowed elements from this folklore for her 1818 novel 'Frankenstein'.",
"donny - Donny Beals is one of the kids enchanted by antagonist Andre Linoge in Stephen King's miniseries, 'Storm of the Century' (1999). Actor Colm Feore, who plays Linoge, took it upon himself to befriend all the child actors so that they wouldn't actually be scared of him. How nice of him to try and Colm the kids!",
"final - Horror nerds are familiar with the word 'final'. 'Final girl', 'The Final Chapter' (even though it isn't), 'Final Destination' (even though it isn't). But have you heard of 'The Final' (2010)? The plot revolves around a group of high school outcasts who are being bullied. They decide to get revenge on the bullies by giving them their just desserts... in gruesome fashion. Talk about dulce 'dead' leche!",
"sense - We all know what happens to Bruce Willis' character at the end of M. Night Shyamalan's 'The Sixth Sense' (1999). But did you know that Willis was contractually obligated to do the movie? After shutting down production of 'The Broadway Brawler' by firing the director, Willis owed Disney two movies. 'The Sixth Sense' was the first, and 'The Kid' (2000) was the second.",
"leper - Leper refers to someone affected with leprosy, but it also can mean an outcast of society. Many horror antagonists are lepers, but that doesn't necessarily mean they are bad; they just want to be loved!",
"cheek - Hannibal Lecter's first act of cannibalism was that of consuming a butcher's cheek. He attacked the butcher for insulting his adoptive mother, Lady Murasaki. The biting of the cheek would later become Hannibal's signature attack. It's best not to make a 'tongue in cheek' remark to Hannibal!",
"breed - Clive Barker's 'Nightbreed' (1990) was not well received when it released, but has gained a cult following over the years. Barker has said that the studio butchered the film in the editing room and tried to market it as a standard slasher, and has expressed wanting to find the original reels to release his version. Barker was able find the original material and in 2014 released the 'Barker Cut'.",
"fiery - Carrie, played by Sissy Spacek, brings her school down in fiery fury in 'Carrie' (1976). The hand that we see at the end of the film is actually Specek's hand. The director, Brian De Palma, insisted on getting a double, but Spacek maintained that she had to be the one to do it. When setting up the scene, de Palma was uncomfortable about burying her so he had her husband do it. Till death do us part I guess!",
"agony - In James Wan's Saw (2004), Jigsaw forces his victims to put themselves through extreme agony in order to be release from their grisly contraption. Many of the scary scenes were inspired by Wan's and cowriter Leigh Whannell's nightmares from when they were kids. Now that's a dream come true!",
"dusty - Abandoned houses are usually extremely dusty... and haunted. One prime example is the titular character's house in 'The Woman in Black' (2012). In addition to being dusty, the house is filled with cute/creepy mechanical toys and music boxes. These props were real life antiques on loan from a collecter. The dust was also real as the house was an avid dust collecter.",
"bates - Anthony Perkins plays Norman Bates in 'Psycho' (1960). Perkins would reprise this role in 'Pycho II' (1983). The original showerhead in the first film was also supposed to reprise its role in the sequel, but was stolen just before filming began. Literally a stolen opportunity!",
"karma - Karma seems to be prevalent in horror movies; particularly 'bad karma' in the form of slasher rules. Characters doing 'bad things' such as having sex, drinking alcohol, doing drugs, etc. always meet an untimely demise. In a way, many slasher victims 'had it coming'. Sounds like a religious agenda to me!",
"gouge - The eye gouge is a popular move in the horror world. In 'The Evil Dead' (1981), Ash uses it to great effect against his possessed friend, Scott. In '28 Days Later' (2002), protagonist Jim uses it to take main solider baddie, Major Henry West. Even baddies use it such as in 1982s 'Friday the 13th Part III' when Jason expertly shoots an arrow into one of his victim's eyes. There are many different uses of the eye gouge, but they all have one thing in common- no one sees it coming!",
"phone - 'We traced the call. It's coming from inside the house!' Horror nerds will recognize this line as the major plot point for 'When a Stranger Calls' (1979), but we all know the first movie to use this chilling line was 'Black Christmas' (1974). The two films are so close in that plot point that some fans theorize that the killer from both films are one in the same and therefore exist in the same world. 'Phone Call Cinematic Universe', anyone?",
"danny - The child actor that plays Danny Torrence in 'The Shining' (1980) is also named Danny; surname Lloyd. Director Stanley Kubrick had soft spot for Lloyd and so he hid the fact that they were filming a horror movie from him. From Lloyd's point of view, they were filming a drama. He didn't find out the truth until several years after filming when he finally saw the movie, albeit a heavily edited version.  Lloyd was 17 years old when he finally saw an uncut version.",
"faery - In Guillermo del Toro's 'Pan's Labyrinth' (2006), two faeries end up getting eaten by the Pale Man due to protagonist Ohpelia's disobedience. The Pale Man chases her shortly after. During a screening of the film in which Del Toro sat next to Stephen King, Del Toro observed King squirming in his seat during this chase scene. Del Toro says seeing this reaction was like winning an Oscar.",
"myers - Michael Myers is the antagonist of John Carpenter's 'Halloween' (1978). Myers actually gets his name from the studio head of Miracle Films. Carpenter wanted to pay tribute to Myers for distributing his first, 'Assault On Precinct 13' (1977). Halloween day was never the same in the Myers' household...",
"offed - Past tense of 'off' as in to kill or murder. In horror movies, someone's gotta get offed, right? Wrong. From horror classics such as 'Freaks' (1932) and 'The Amityville Horror' (1979) to the modern such as 'The Blair Witch Project' (1999) and 'The Babadook' (2014), there are many great horror movies that don't include anyone biting the dust.",
"abyss - A group of adventurous woman take a trip into the abyss in 2005s 'The Descent'. Eventually they are trapped in the cave they are exploring and encounter deadly subterranean creatures known as 'crawlers'. These crawlers were designed to resemble Count Orlok from 'Nosferatu' (1922). However, the appearance of the crawlers was kept secret from the actors until they filmed the scene of the first encounter. When the actors finally saw the crawlers they all ran off the set genuinely scared.",
"doomy - The prescence of dead animals always provides a doomy atmosphere. Jordan Peele uses this to great affect in his first horror film, 'Get Out' (2017), in the scene where the main characters hit a deer while driving. A dead deer is meant to symbolize the loss of innocence. But in some states, it might mean the loss of your driver's license!",
"laura - 'Eyes of Laura Mars' (1978) is an American giallo film written by John Carpenter and was his first major studio film. Originally Barbra Streisand was originally attached play the titular role, but the role instead went to Faye Dunaway. Streisand sings the theme song 'Prisoner'; this would be the only song she sings for a movie in which she does not appear in.",
"porno - 'Porno' (2019), equipped with a slightly misleading title, is a film about 5 Christian teens accidentally releasing a deadly succubus in their local movie theater. In response to the question 'What do you want the audience to take away?', the director, Keola Racela, said: 'I hope they laugh. I hope we get in a few good scares too.' There goes any confirmation of whether it's pro or anti religious!",
"teeth - The plot of 'Teeth' (2007) revolves around a young lady, Dawn, having vagina dentata, or toothed vagina. This allows her to fight back when being assualted by horrible men. However, during the end credits there is a statement that reads: 'No man was harmed in the making of this film.' Disappointed!",
"penis - Horror is one of the genres where you are more likely to see male genitalia. But times have changed and the prevelance of full frontal male nudity is on the rise. This is due to less strict ratings on streaming platforms and writers and directors wanting to level the playing field in relation to the sexploitation of woman's bodies. But horror remains the leader in lost weinersnitchels.",
"board - As in Ouija board. Quija boards play a big role in connecting the natural and supernatural worlds together, such as in 1973s 'The Exorcist'. 12-year-old Regan plays with a Quija board and accidentally befriends international demon Pazuzu, allowing him to possess her. Whatever happened to good ol' Monopoly!",
"misty - Misty atmosphere always sets the tone on a haunted night, such as in Michael Jackson's 'Thriller' music video. John Landis directed this music video and also directed 'An American Werewolf in London' (1981) a few years prior. Due to this the two are connected in many ways. Landis uses the same make-up and special effects for both, and the were-tranformation sounds are the same. The score used in 'Thriller' was originally intended for 'An American Werewolf in London'. You can almost say this was a sidequel!",
"erica - 'Erica' (2019) is a fully filmed interactive horror mystery thriller game. The plot revolves around a young woman, Erica Mason, grappling with nightmares from her childhood and trying to unravel the truth of her family's occult past.",
"bared - In horror movies, we know that those who have bared all also lose all... of their life. 'The Cabin in the Woods' (2011) takes this trope to heart. It features the classic slasher archetypes: the whore, the athlete, the scholar, the fool and the virgin. Sticking to the script, as soon as 'the whore' bares all, she is killed shortly after. And we barely go to know her!",
"peter - Peter Weyland sends a team of scientists in search for the key to life in 2012s 'Prometheus'. Director Ridley Scott asked the design team to not rely too much on H.R. Giger's original designs from 'Alien' (1979). As they worked however, their drawings subconciously contained 'Gigeresque embellishments'. So they decided to bring Giger onboard to consult with the designs.",
"willy - Nicolas Cage stars in 'Willy's Wonderland' (2021). Cage plays a mysterious drifter that ends up having to spend a whole day in an abandoned Chucky-E-Cheese-esque restaurant that houses deadly animatronics. Though there are many similarities, the movie is not an adaptation of the 'Five Nights at Freddie's' video game. The director, Kevin Lewis, describes the movie as 'Pale Rider' (1985) vs 'Killer Klowns from Outer Space' (1988). Well whoop-de roddam de-doo!",
"cower - In 'Jurrassic Park' (1993), the lawyer character, Rostagno, ran out of the Jurrassic jeep and cowered in the bathroom stall. Unfortunately the T-Rex still got to him so it must have been a crappy hiding spot!",
"thing - 'The Thing' (1982) by John Carpenter is his personal favorite of all his films. When it was released it bombed at the box office and critics hated it leading the studio to cancel their multi-picture deal with Carpenter. The film almost killed his career, but to Carpenter's relief, it gained a massive cult following after a home video release. Fans are the only thing you can rely on!",
"blair - 'The Blair Witch Project' (1999) was monumental in popularizing the found footage film style. It was also one of the first theatrical releases to make use of viral marketing. One year before the release, a website launched detailing the premise of the 'documentary' including interviews from the actors' parents. By the time of its release it got so popular that it overshadowed the big budgeted release of 'The Haunting' (1999). 'The Blair Witch Project' would end up on the Guiness Book of World Records for 'Top Budget: Box Office Ratio' (for a mainstream feature film). Now that's finding success!",
"frank - Frank Cotton, played by Sean Chapman as a human and by Oliver Smith as the skinless form, is the main antagonist of “Hellraiser” (1987). It turns out that both of the actors' dialogue were dubbed. The film was shot in London as it was originally supposed to be set in England, but the studio, New World, thought it would be more marketable if it was set in America. Many of the English actors were then dubbed by American actors. Well that's interesting, innit?",
"break - In “Misery” (1990) Annie Wilkes (Kathy Bates) breaks Paul Sheldon's (James Caan) legs by the ankle to ensure he does not escape. In the book Annie actually cuts off Sheldon's left foot; this version was actually in the original script and because of that the filmakers lost two major stars. Bette Midler turned down the role because she “didn’t want to saw off someone’s foot.” And Warren Beatty, who was interested in playing Sheldon, had concerns about the scene. Ultimately the roles went to Bates and Caan, and the rest is herstory.",
"sewed - In “The Nightmare Before Christmas” (1993), Sally is a humanoid ragdoll with body parts that are sewed together. The plot of “Nightmare” was originally supposed to reveal Oogie Boogie as Dr. Finkestein in disguise. His motive being that he was jealous of Sally's love for Jack Skellington. Tim Burton hated this idea so much that he reportedly kicked a hole in a wall after hearing it. I guess that's one way to put your foot down!",
"carol - Carol Anne Freeling is the little girl that is kidnapped by ghosts in “Poltergeist” (1982). Drew Barrymore was considered for the role of Carol Anne, but the role ultimately went to Heather O'Rourke. However, Barrymore's audition for this movie landed her a part in Spielberg's other movie, 'E.T. the Extra-Terrestrial' (1982).",
"piety - Piety is a central theme to many horror movies, particularly “The Conjuring” trilogy. The trilogy follows the pious duo of Lorraine and Ed Warren as they use the power of Christ to cleanse houses or individuals. In the first movie, Ed Warren performs an exorcism on Carolyn Perron. However, according to Catholic thelogy only Bishops and priests can perform exorcisms. If a lay person were to try and perform one, it would result in harm to them and the possessed. Sounds like a bunch of malarkey to me!",
"gypsy - The “gypsy” curse is a familiar trope in horror movies. We see this trope in Sam Raimi's “Drag Me to Hell” (2009). The movie was also inspired by folklore from Greece and German/Austria. Mrs. Ganush, the antagonist, closely resembles Furies or Eurynes, entities summoned to exact revenge, from Greek Mythology. From German/Austria, the legend of the Krampus tells of a creature who would drag misbehaving children to the underworld during Christmas.",
"movie - “The Cabinet of Dr. Caligari” (1920) is known to be the first true horror movie.  Though “Caligari” is considered to be one of the most influential movies in the horror genre as well as German Expressionist cinema, the artistic style was partly due to its low budget. The director, Robert Wiene, had to shoot in unconventional angles because they were so confined in their low budget sets. And because they didn't have acccess to electricity they had to paint light beams on backdrops. When life gives you lemons, make lemonade. In this case, they made a masterpiece.",
"house - “The House of the Devil” (2009) is a sort of period piece horror film set in the 80s. The filmmakers decided to go all in on that time period; the use of 16mm film and the shooting style is indicative of the 80s. There was even a promotional release on VHS in a clamshell box. The last movie to be released in the VHS format was “A History of Violence” (2005).",
"afire - The Thing from “The Thing from Another World” (1951) was set afire after it was defeated to ensure it stayed dead. James Arness, the actor who played The Thing, wished it never lived. He apparently was so embarrassed of this role that he didn't attend the premiere. His main complaint being that the monster makeup made him look like a giant carrot. This is reinforced in the movie when one of the characters makes that exact remark. Attack of the Killer Carrots, anyone?",
"trike - Damien from “The Omen” (1976) knocks his mother over the railing with a trike. Harvey Stephens seemed to be perfect as anti-christ Damien. The way Richard Donner, the director, auditioned for Damien was to have the child actor attack him for the wedding scene. Stephens was chosen because he attacked the most violently. And according to Billie Whitelaw, who portrays Mrs. Baylock, he was always misbehaving on set. Maybe this film is more biopic than fiction!",
"ouija - We see the use of a Ouija board in many horror movies, but what is it exactly? Ouija is also known as a spirit board or talking board. Though its not the first of its kind, Ouija was the first commercially patented version, released in 1891. The spritualism craze was underway in the 19th century and many people were using Ouija in attempt to contact deceased loved ones. Around this time Ouija was not something that was feared and served more as a dark parlor game. It remained this way until 1973, when “The Exorcist” came out. Ouija gained occult status as well as the ire of religious fundamentalist groups. Anything that ruffles religious feathers is OuijA-Ok to me.",
"drain - Pennywise (Tim Curry) emerges from the drain to terrorize Eddie Kaspbrak (Adam Faraizi) in 1990s “It” miniseries. Though many people see Curry as the eponymous Pennywise, he apparently cannot see himself as Pennywise. It turns out that Curry has suffered a debilitating case of coulrophobia (a fear of clowns) most of his life. According to his contract for the miniseries, there was to be no reflective surfaces within sight of him while he was in makeup.",
"halve - A pendulum is used to halve an unfortunate (but deserving?) victim in “Saw V” (2008). The pendulum trap is inspired by Edgar Allan Poe's short story “The Pit and the Pendulum”. During filming of “Saw V” they actually had a working pendulum trap, complete with a real blade. Whenever the actor was beneath it, a foam blade was switched in. Good thing the director doesn't really mean it when he yells, “CUT”",
"purge - 2013s “The Purge” depicts an America that has an annual “Purge” event in which, for 24 hours, all crime is legal. The director, James DeMonaco, apparently got the idea for this movie because of something his wife said after a road rage incident. They were driving on the freeway when a drunk driver cut them off nearly killing them. He confronted the driver and got into a fistfight with them. Police eventually came and broke up the fight. Afterwards, DeMonaco's wife commented how great it would be to have one free murder a year. Sounds like someone has life rage!",
"choke - One of the suvivors from “Final Destination” (2000) is choked to death by a clothesline. The movie takes inspriration from real life events. On July 17th, 1996, an airplane exploded in the exact fashion outlined in the movie. The news footage shown is actual footage covering the disaster. Furthermore, the music played throughout the film was by John Denver, a musician who died in a plane crash.",
"broke - In Alfred Hitchcock's “Rear Window” (1954), professional photographer L.B. Jefferies, played by the late Jimmy Stewart, reserves to spying on his neighbors after he broke his leg on the job, and witnesses what appears to be a murder. This movie came to be known as one of the infamous “Five Lost Hitchcocks”. The other 4 being: “The Man Who Knew Too Much” (1956), “Rope” (1948), “The Trouble with Harry” (1955), and “Vertigo” (1958). Hitchcock bought back the rights for these movies and gave them to his daughter as part of his legacy. The movies were unavailable for 30 years until their rerelease in the 1980s. Sounds like someone didn't like sharing!",
"raise - Dr. Herbert West is determined to raise the dead in 1985s “Re-Animator”. The infamous scene in which a zombie head molests a restrained female character did not sit well with the wife of David Gale, the actor who played the zombie head. Though Gale felt awful when doing the scene, his wife, after watching the scene during the screening, left and never came home. They divorced shortly after. Good for her!",
"friar - Father Burke is the friar sent to investigate the demonic happenings in “The Nun” (2018). Taissa Farmiga plays Sister Irene, Father Burke's companion. Taissa is the younger sister of Vera Farmiga, who plays Lorraine Warren in “The Conjuring” franchise. The two sisters happen to both play characters that have clairvoyant abilities. Sister, sisterrrrrr!",
"brain - “Braindead” is the original title of Peter Jackson's 1992 film “Dead Alive”. The funny sequence in which the protagonist takes a baby zombie to the park was apparently a last minute addition. Jackson had finished the film under budget with NZ$45,000 remaining, and used it to film the extra scene. Such a last minute gem as this ended up being one of the best parts of the movie. It pays to budget!",
"trope - The “Let's Split Up, Gang!” is perhaps the most frustrating horror trope. Viewers often question why the characters would make such a decision. The meta film “The Cabin in the Woods” (2011) seeks to answer this question. We find out early on in the film that there is an organization responsible for orchestrating real life horror scenarios. One of the steps to a successful operation is drugging the would be victims, causing them to make bad decisions as well as fall into their archetypal roles. The inspiration for the plot comes from the writer's own upbringing in Los Alamos, New Mexico, a place filled with scientists and co-workers all going about their business and living seemingly routine and ordinary lives even though they were building nuclear weapons that could potentially destroy the entire world.",
"eaten - Getting eaten is a common way of dying in horror movies, especially in zombie movies like the remake of George Romero's “Dawn of the Dead” (2004), directed by Zack Snyder. Though generally horror remakes do not fare well with fans, the DoD remake has a 7.6/10 rating by users on IMDB. Romero himself has said he was surprisingy impressed by it. He expressed that it's a good action film, but lacks the social commentary the original DoD had. This bit of criticism is interesting given that the social commentary of Romero's “Night of the Living Dead” (1968) was accidental.",
"paris - “American Werewolf in Paris” (1993) is a sequel only in name to “American Werewolf in London” (1981). Originally it was supposed to be a direct sequel written by John Landis himself. The plot involved Debbie Klein (a character mentioned but never seen or heard in the original film) investigating the murders of Jack and David. The production company rejected this script, however, and Landis refused to write another for them. The film then went through development hell, rotating through multiple writers and directors, resulting in a film that doesn't hold a candle to the original. A good example of having “too many cooks in the kitchen”. Where are my scallops?!",
"klown - “Killer Klowns from Outer Space” (1988) is a great comedy horror in which alien Klowns invade Earth. The Klown make-up is amazing in this movie, so you'll be surprised to find out that it's 2 million dollar budget was spent mostly on production costs. Klown make-up and visual effects were done very cheaply. Cheap economically, but not cheap in quality!",
"crass - Much like the in-laws in 2015s holiday horror, “Krampus”. Due to the in-laws' behavior, the families spiral into dysfunction, leading young Max to inadvertently summon the wrath of Krampus. Michael Dougherty, who directed and wrote this film, includes a couple of references to another film he wrote and directed, “Trick 'r Treat” (2007). One such example happens in a scene where Max gives candy to his cousins. In his candy stash you can see a lollipop identical to the one used as a weapon by the demonic child Sam.",
"murky - “Dark Water” (2005) is an American remake of the Japanese horror of the same name. A mother and daughter move into a rundown apartment only to be plagued by a ghost and its accompanying murky(dark) water. Water is a major element in this movie. In nearly every scene, water is present in one form or another (I.E. rain, humidity, in appliances). To create the effect of murky(dark) water they used color dye and flat expired soda pop. Maybe they used purple drink!",
"flora - Deadly infectious flora are the main horrors in Playstations “The Last of Us” (2013) video game and 2021s folk horror “Gaia”. The depiction of flora infected humans are so similar between the two that some have said the flimmakers of “Gaia” blantantly ripped off the video game. Some are not so cynical and consider the movie to be a spiritual prequel. Whatever the case, both creators seem to have gotten inspiration from the same ant infecting fungi called Cordyceps.",
"drape - In Tim Burton's “Beetlejuice” (1988), recently deceased Barbara and Adam attempt to scare off the new residents of their house by draping white sheets over themselves to look ghostly. Michael Keaton is legendary in the titular role of Beetlejuice, having allegedly ad-libbed 90% of his lines. However, he apparently originally passed on the role. He changed his mind after meeting with Burton. Good thing Burton knocked some Kean sense into him!",
"space - “Jason X” (2001) takes the “Friday the 13th” franchise to space. This is the second movie in the franchise to not include “Friday the 13th” in its title. The first being “Jason Goes to Hell: The Final Friday” (1993). The reason for this was because New Line Cinema did not have rights to the title. While seeking to do a cross over with “A Nightmare on Elm Street” in which Jason battles Freddy Krueger, New Line Cinema negotiated with Paramount Pictures for rights to the “Friday” series. Ultimately Paramount Pictures granted rights to the Jason character, but not the title. They made two Jason movies before finally making “Freddy vs. Jason” (2003).",
"jesus - “Jesus wept.” was Frank Cotton's last words in “Hellraiser” (1987) before being ripped to shreds... again. Andrew Robinson, who plays Cotton wearing his brother's skin, actually ad-libbed the line. The original line was supposed to just be “F*** you.” However, Robinson does not like using foul language so he changed the line to one that he used as a child. Jesus smiled!",
"booze - You can't have a slasher without booze. How else are teens going to make fatal decisions? But how do filmmakers simulate the consumption of alcohol without actualy consuming it? For beer they swap it for non-alcoholic beer and simulate the froth with a mixture of powdered egg white and an acid like lemon juice. Various juices are subbed in for wine. For hard liquor they use water for vodka and iced tea for whiskey.",
"tiara - Getting a tiara on prom night is the least of Kimberly Hammond's worries in 1980s “Prom Night”. Filmmakers use “555” numbers to avoid using a real number on screen. However, “Prom Night” is one of the few movies to use a real number: (614) 481-6221. It is still a working number as of 2021. It is the fax number for the Grandview Heights (Ohio) Parks & Recreation department.",
"white - “White Zombie” (1932) is known to be the first feature length zombie film. There's no denying its major impact in the zombie genre; it's influence stretches far and wide. In fact, Rob Zombie, born Robert Bartleh Cummings, derived his stage name from the title. The title was also the source for his bands name, “White Zombie”. All I'm wondering is, “why zombie”?",
"mulch - In 2005s sci-fi horror “War of the Worlds”, starring Tom Cruise, humans are abducted and turned into mulch for the aliens' “red weed”. Steven Spielberg directed this modern take on H.G. Wells classic novel of the same name. This marks the second time Spielberg and Cruise work together, but it would also mark the last time. Spielberg has mentioned he would never make another film with Cruise due to his behavior on set related to Scientology. Apparently Cruise brought a fully staffed tent from the Church of Scientology on the set of “War of the Worlds”.",
"deity - A man's greed leads him to worship an evil deity in “Tumbbad” (2018), an Indian Hindi-language period horror movie. This movie took 6 years to film; the scenes depicting Tumbbad, a city cursed with perpetual rainfall, was filmed over 4 monsoons. That's what I call method filming!",
"buggy - The “Doom Buggy” is the appropriately named vehicle that takes tourists around the Haunted Mansion in Disneyland. Though it's hard to imagine the attraction without the buggys, old sketches reveal that an early concept of Haunted Mansion had tourists walking through the attraction with their own two feet. Walking to their own deaths!",
"genre - According to Wikipedia, horror is a genre of speculative fiction which is intended to frighten, scare, or disgust. What's unique about the horror genre is that it often reflects the cultural fears of the time. This can be seen in “A Nightmare on Elm Street 2: Freddy's Revenge” (1985). In the sequel, Fred Krueger slowly takes over a male teenagers body to do his killing. Thanks to the film's homosexual undertones and overtones, many saw Krueger as a metaphor for homosexuality. Made during the height of the AIDS crisis, it's hard not to see which core fears this film was targetting.",
"drown - Pamela Voorhees blames the horny camp counselors for letting her precious Jason drown in 1980s “Friday the 13th”. SPOILER ALERT: At the end of the film we find out that Mrs. Voorhees, played by Betsy Palmer, turns out to be the killer. It turns out the only reason Palmer took the role was because she was in desperate need of a new car. She originally thought the movie was “a piece of sh**”. Over the years she learned to love the film as it gave her notoriety in the horror community. It was more like a piece of gold!",
"stern - A stern Jesus can be found all around the Russian horror film “Viy” (1967). The story of Viy can be traced back to the 1800s by a Ukrainian-born Russian writer Nikolai Gogol. This story was first adapted in a silent film in 1909, but has since been lost. It has been adapted several times since then and has inspired other horror movies such as 1960s “Black Sunday”. “V For Vendetta” (2006) is apparently not one of those movies.",
"weird - Horror movies like to capitalize on the weird. One example being 1932s “Freaks”. This movie ensemble of real life circus folk was banned in a number of cities in the US. The laws were never repealed, but the banning is no longer enforced, so it is technically illegal to be shown in certain parts of the US. Now THAT is weird!",
"sweet - In “Alice Sweet Alice” (1976) the titular character, a 12 year-old, is suspected of murdering her younger sister, Karen. Karen was played by noneother than a young Brooke Shields in her feature film debut. There were talks of a remake of this cult classic with Shieds involved. No other news has come out since the mention of it so it seems unlikely to happen.",
"crown - The folk horror “Midsommar” (2019) features an astounding flower crown for the May Queen. The actual crown worn by Dani, played by Florence Pugh, was auctioned off for $15,000. It was hand-crafted with dozens of silk flowers and weighs just 1 pound. The May Queen dress, worn by Dani at the end of the film, weighs over 30 pounds and has 10,000 silk flowers. This sold for $65,000. That's some expensive foliage!",
"magic - Dark magic invokes the “Deadites” in Sam Raimi's “Evil Dead” trilogy. As one of the most recognizable horror trilogies of all time, you'll be surprised to hear that it almost never got made. Initially, Raimi was not able to acquire the money to fund the second movie. It just so happens that Stephen King was a huge fan of the original, and so he convinced the De Laurentiis Entertainment Group production company to finance the sequel. Hail to the King!",
"ghoul - The Crypt Keeper is a ghoul and the host of horror anthology series “Tales from the Crypt” (1989–1996). The TV series was based on a comic book series of the same name that ran from 1950 to 1955. In the comic series, there were 3 rotating hosts: the Crypt Keeper, another ghoul called the Vault Keeper, and the Old Witch. The trio are known as the GhouLunatics. I couldn't have named them better myself!",
"hound - The “Groaner” is a demonic hound that appears in 1999s horror video game “Silent Hill”. This hound demon is one of the first enemies you encounter in the game, however, strangely enough, they did not make an appearance in 2006s horror film adaptation of the same name. The “Dark Nurse”, another recognizabe enemy from the games, did make it into the film. In the film, they walk in stumbling, disjointed movements. To achieve this effect, the actos were filmed walking backwards, and then the film was reversed. ",
"padre - Characters in horror movies always seem to seek the aid of a padre, such as in “The Curse of La Llorona” (2019). This movie is the lowest grossing film within The Conjuring Universe. Perhaps a theater in Montreal, Quebec was trying to help it along. Apparently, in a showing that was supposed to be “Pokémon: Detective Pikachu” (2019), “La Llorona” was played instead, causing children to run out screaming. They chose Pikachu!",
"geist - A word originating from German meaning the spirit of an individual or group. “Ju-On: The Grudge” (2002) is about vengeful geists who curse anyone who enters their former house. Takako Fuji plays the terrifying Kayako in four theatrical runs of the Grudge franchise: in this film and its sequel, and the American remake and its sequel. Fuji is a ballerina and trained contortionist so no CGI was needed to produce the bone-breaking, shambling movements Kayako is known for.",
"crypt - “From Dusk Till Dawn” (1996) was originally supposed to be released as a “Tales from the Crypt” (1989)-related movie, but due to disagreements with the producers Quentin Tarantino and Robert Rodriguez decided to make it a standalone movie. In this movie, Selma Hayak improvises the snake dance scene, complete with a real live snake. Hayak has a fear of snakes and so was originally going to turn down the snake dancer role, but Rodriguez had different plans. In an effort to get her to take the part, he lied to her and said Madonna was ready to take the part if Hayak turned it down. So she spent two months with therapists to overcome her fear. That's one way to get someone to do therapy!",
"mimic - Mutant insects are out to get humankind in Guillermo del Toro's “Mimic” (1997). Del Toro has expressed his dislike of the theatrical cut, as it was heavily influenced by the Weinsteins and strays from his style. He has since released a Director's Cut of “Mimic” which improves upon the tone and feel to match Del Toro's vision.",
"billy - Billy the Puppet is used by John Kramer, the main antagonist of the Saw franchise, to communicate to his victims. Though the name of the puppet is never referenced in the films, we know its name through interviews with the filmmakers. The original Billy was created with clay and papier-mâché. Its eyes were black ping pong balls and paper tower rolls were used for filler inside. At least we now know Billy is full of it!",
"baron - Baron Boris von Frankenstein is the head of the Worldwide Organization of Monsters in the stop motion horror comedy, “Mad Monster Party?” (1967). The movie features many classic Universal monsters, but to cut down on costs, the producers had to use different names for some of the monsters to avoid paying any royalty fees. Only Count Dracula, Dr. Jekyll and Mr. Hyde and the Invisible Man are named by name as they were in public domain at the time of filming.",
"raven - Roger Corman's “The Raven” (1963) is very loosely based on Edgar Allen Poe's 1845 poem of the same name. Vincent Price stars in the film as the sorceror Dr. Erasmus Craven. It turns out Price's portrayal of the character inspired Marvel's Dr. Strange. Dr. Strange's likeness is even modelled after Price and pays homage with his full name: Stephen Vincent Strange. Who knew you could get a doctorate in sorcery!",
"skull - “The Skull” (1965) is a British horror film in which a collector comes into possession of the skull of the Marquis de Sade and learns it is possessed by an evil spirit. Marquis de Sade was a real person; a writer known for his erotic fiction depicting numerous acts of sexual cruelty. In fact, the words “sadism” and “sadist” are derived in reference to his name, works and sexual lifestyle. Though “The Skull” is based in fiction, Sade's skull was actually stolen shortly after his burial. It must have been to be!",
"guilt - Jigsaw's victims must face their own guilt in order to survive their deadly traps in the “Saw” franchise. Love it or hate it, the movies always made money in the box office. Which is probably why they kept coming out. In fact, every year from 2004 to 2010 a Saw movie came out. This makes it the only franchise to have released 7 installments in consequtive years. Who saw that coming?!",
"chief - Chief Martin Brody (ACAB) is the protagonist of Stephen Spielberg's “Jaws” (1975). When Spielberg first heard the theme John Williams had composed, he originally didn't like it. Williams ended up winning “Best Music, Original Dramatic Score” at the Oscars for his work on “Jaws”. Before the movie he was relatively unknown. Williams attributes the movie to jumpstarting his career. Sounds like he escaped the Jaws of failure!",
"booty - ",
"crisp",
"horse",
"saint",
"fable",
"birds",
"green",
"blind",
"campy",
"darts",
"other",
"carve",
"grabs",
"bible",
"chili",
"grasp",
"drake",
"djinn",
"jacky",
"flesh",
"piano",
"goose",
"gnash",
"idols",
"baker",
"dicey",
"bites",
"lucky",
"annoy",
"roach",
"pants",
"omens",
"mages",
"kills",
"heist",
"storm",
"urban",
"banes",
"gushy",
"reaps",
"gloom",
"abuse",
"deals",
"pagan",
"clash",
"binds",
"slash",
"cords",
"chain",
"chewy",
"lynch",
"allen",
"bound",
"slits",
"sixth",
"runes",
"angry",
"miner",
"agast",
"oozed",
"henry",
"clock",
"baddy",
"wield",
"boney",
"dares",
"float",
"troll",
"ditch",
"puker",
"quoth",
"satan",
"crave",
"ogres",
"moral",
"decay",
"shops",
"trick",
"tombs",
"creak",
"crash",
"mince",
"hexes",
"wicca",
"witch",
"puked",
"grunt",
"camps",
"brood",
"blobs",
"chows",
"louie",
"donna",
"rigor",
"hotel",
"wendy",
"cabin",
"treat",
"brace",
"gourd",
"widow",
"james",
"fatal",
"fangs",
"spook",
"goats",
"torch",
"lunar",
"codes",
"omega",
"ducks",
"ahabs",
"lambs",
"leech",
"elegy",
"agist",
"scaly",
"horde",
"alice",
"afoul",
"cried",
"derry",
"razor",
"enemy",
"dazed",
"under",
"howls",
"slain",
"ashed",
"chews",
"cooks",
"chunk",
"mungo",
"flood",
"pikes",
"woman",
"mimes",
"paolo",
"mists",
"coals",
"gills",
"fires",
"cowed",
"frogs",
"beaky",
"booed",
"veiny",
"horny",
"swamp",
"quote",
"plead",
"water",
"growl",
"train",
"texas",
"chefs",
"entry",
"tense",
"hippo",
"snake",
"annie",
"fried",
"mummy",
"mercy",
"among",
"chasm",
"liver",
"spell",
"ailed",
"alley",
"photo",
"dance",
"cells",
"seven",
"caged",
"blunt",
"husky",
"wails",
"booby",
"goths",
"awoke",
"shaun",
"opera",
"megan",
"culty",
"eddie",
"magus",
"canoe",
"fears",
"drugs",
"gnarl",
"shank",
"hoove",
"chest",
"prank",
"siren",
"panda",
"herbs",
"claws",
"kabob",
"drunk",
"lynch",
"hover",
"ashes",
"signs",
"lodge",
"gooey",
"demon",
"clubs",
"moans",
"busan",
"dusky",
"noise",
"apart",
"chill",
"feral",
"faith",
"steam",
"nicky",
"shine",
"randy",
"oozes",
"coven",
"bleak",
"crazy",
"beach - The setting for the horror movie ,'Old' (2021), by M. Night Shyamalan. Haunted beach",
"freak",
"harms",
"gnome",
"glove",
"offer",
"loser",
"hacks",
"being",
"hives",
"grief",
"chads",
"himbo",
"video",
"naked",
"hatch",
"roman",
"shark",
"cysts",
"fairy",
"ralph",
"calfs",
"elder",
"shred",
"dummy",
"crabs",
"slime",
"evils",
"haunt",
"crime",
"jotun",
"eagle",
"harga",
"rabid",
"story",
"stabs",
"arson",
"agism",
"veils",
"patty",
"antsy",
"manor",
"gored",
"david",
"bears",
"viral",
"lakes",
"satyr",
"hopes",
"twins",
"caved",
"fight",
"dolls",
"bully",
"blade",
"sheep",
"dices",
"nanna",
"mandy",
"wolfs",
"faces",
"mouth",
"nancy",
"adult",
"music",
"expel",
"beady",
"ichor",
"baked",
"bathe",
"catch",
"dress",
"nails",
"awake",
"beast",
"vicar",
"bosom",
"count",
"chops",
"queen",
"jimmy",
"hills",
"blaze",
"tooth",
"sawed",
"sword",
"carny",
"beers",
"hausu",
"biker",
"oscar",
"exile",
"attic",
"lover",
"hangs",
"meats",
"nymph",
"ember",
"snaps",
"pious",
"hairy",
"wreck",
"dread",
"curse",
"wards",
"write",
"organ",
"taboo",
"fiend",
"plane",
"covet",
"boobs",
"axing",
"edgar",
"latex",
"hunts",
"arise",
"allan",
"crush",
"blood",
"mossy",
"hooks",
"bundy",
"diary",
"bakes",
"black",
"harry",
"tribe",
"rocky",
"mushy",
"giant",
"dooms",
"muddy",
"campy",
"dirty",
"traps",
"gumbo",
"jujus",
"myths",
"feeds",
"choir",
"clone",
"faint",
"artsy",
"cloak",
"virus",
"evoke",
"hurls",
"biter",
"vomit",
"cleft",
"nanny",
"sheds",
"caned",
"stake",
"human",
"hitch",
"gator",
"atone",
"risen",
"goner",
"morph",
"golem",
"child",
"pokes",
"wight",
"boats",
"combs",
"cynic",
"felon",
"fetid",
"alien",
"alarm",
"mauls",
"crude",
"wells",
"chant",
"chola",
"devil",
"sever",
"amity",
"panic",
"maria",
"hosts",
"copes",
"clown",
"climb",
"pizza",
"louis",
"actor",
"mural",
"lives",
"cholo",
"husks",
"hydra",
"norma",
"larva",
"moses",
"aster",
"pukes",
"armed",
"rhino",
"alone",
"dying",
"altar",
"acids",
"tarot",
"brick",
"bride",
"hicks",
"grave",
"fever",
"upset",
"guest",
"nerds",
"bobby",
"mazes",
"choky",
"vigil",
"graft",
"diced",
"poked",
"chomp",
"moose",
"crawl",
"night",
"raimi",
"eerie",
"rainy",
"hexer",
"titan",
"shoot",
"totem",
"clive",
"toxic",
"hades",
"wound",
"bleat",
"chaos",
"syrup",
"nurse",
"books",
"shore",
"amiss",
"nasty",
"damns",
"poker",
"burst",
"cribs",
"hells",
"barns",
"slice",
"mourn",
"harpy",
"fungi",
"hocus",
"punch",
"croak",
"churn",
"cries",
"tears",
"eater",
"quiet",
"crept",
"monks",
"acidy",
"jenny",
"films",
"peril",
"arrow",
"aroma",
"feast",
"hides",
"boars",
"clues",
"coils",
"gulch",
"necks",
"slimy",
"codex",
"drags",
"dared",
"boozy",
"sally",
"swarm",
"chuck",
"flame",
"visit",
"beans",
"gulps",
"enter",
"maims",
"shout",
"drill",
"cuffs",
"froze",
"melts",
"scary",
"class",
"crier",
"gruel",
"comes",
"lurch",
"horns",
"stalk",
"arose",
"tempt",
"buffy"
]